MikroElektronika/core_packages/PIC/XC8/def/PIC18LF6393/mcu.h
#define                                 SEG29_bit           _BIT_ACCESS(PORTG,1)
// LCDDATA3<SEG29COM0>
extern volatile __bit                   SEG29COM0           __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 SEG29COM0_bit       _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<SEG29COM1>
extern volatile __bit                   SEG29COM1           __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 SEG29COM1_bit       _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<SEG29COM2>
extern volatile __bit                   SEG29COM2           __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 SEG29COM2_bit       _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<SEG29COM3>
extern volatile __bit                   SEG29COM3           __at(0x7BD5);	// @ (0xF7A * 8 + 5)
#define                                 SEG29COM3_bit       _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<SEG2COM0>
extern volatile __bit                   SEG2COM0            __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 SEG2COM0_bit        _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<SEG2COM1>
extern volatile __bit                   SEG2COM1            __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 SEG2COM1_bit        _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<SEG2COM2>
extern volatile __bit                   SEG2COM2            __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 SEG2COM2_bit        _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<SEG2COM3>
extern volatile __bit                   SEG2COM3            __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 SEG2COM3_bit        _BIT_ACCESS(LCDDATA18,2)
// PORTD<SEG3>
extern volatile __bit                   SEG3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 SEG3_bit            _BIT_ACCESS(PORTD,3)
// PORTG<SEG30>
extern volatile __bit                   SEG30               __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 SEG30_bit           _BIT_ACCESS(PORTG,0)
// LCDDATA3<SEG30COM0>
extern volatile __bit                   SEG30COM0           __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 SEG30COM0_bit       _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<SEG30COM1>
extern volatile __bit                   SEG30COM1           __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 SEG30COM1_bit       _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<SEG30COM2>
extern volatile __bit                   SEG30COM2           __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 SEG30COM2_bit       _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<SEG30COM3>
extern volatile __bit                   SEG30COM3           __at(0x7BD6);	// @ (0xF7A * 8 + 6)
#define                                 SEG30COM3_bit       _BIT_ACCESS(LCDDATA21,6)
// PORTE<SEG31>
extern volatile __bit                   SEG31               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 SEG31_bit           _BIT_ACCESS(PORTE,7)
// LCDDATA3<SEG31COM0>
extern volatile __bit                   SEG31COM0           __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 SEG31COM0_bit       _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<SEG31COM1>
extern volatile __bit                   SEG31COM1           __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 SEG31COM1_bit       _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<SEG31COM2>
extern volatile __bit                   SEG31COM2           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 SEG31COM2_bit       _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<SEG31COM3>
extern volatile __bit                   SEG31COM3           __at(0x7BD7);	// @ (0xF7A * 8 + 7)
#define                                 SEG31COM3_bit       _BIT_ACCESS(LCDDATA21,7)
// LCDDATA4<SEG32COM0>
extern volatile __bit                   SEG32COM0           __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 SEG32COM0_bit       _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<SEG32COM1>
extern volatile __bit                   SEG32COM1           __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 SEG32COM1_bit       _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<SEG32COM2>
extern volatile __bit                   SEG32COM2           __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 SEG32COM2_bit       _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<SEG32COM3>
extern volatile __bit                   SEG32COM3           __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 SEG32COM3_bit       _BIT_ACCESS(LCDDATA22,0)
// LCDDATA4<SEG33COM0>
extern volatile __bit                   SEG33COM0           __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 SEG33COM0_bit       _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<SEG33COM1>
extern volatile __bit                   SEG33COM1           __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 SEG33COM1_bit       _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<SEG33COM2>
extern volatile __bit                   SEG33COM2           __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 SEG33COM2_bit       _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<SEG33COM3>
extern volatile __bit                   SEG33COM3           __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 SEG33COM3_bit       _BIT_ACCESS(LCDDATA22,1)
// LCDDATA4<SEG34COM0>
extern volatile __bit                   SEG34COM0           __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 SEG34COM0_bit       _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<SEG34COM1>
extern volatile __bit                   SEG34COM1           __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 SEG34COM1_bit       _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<SEG34COM2>
extern volatile __bit                   SEG34COM2           __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 SEG34COM2_bit       _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<SEG34COM3>
extern volatile __bit                   SEG34COM3           __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 SEG34COM3_bit       _BIT_ACCESS(LCDDATA22,2)
// LCDDATA4<SEG35COM0>
extern volatile __bit                   SEG35COM0           __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 SEG35COM0_bit       _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<SEG35COM1>
extern volatile __bit                   SEG35COM1           __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 SEG35COM1_bit       _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<SEG35COM2>
extern volatile __bit                   SEG35COM2           __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 SEG35COM2_bit       _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<SEG35COM3>
extern volatile __bit                   SEG35COM3           __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 SEG35COM3_bit       _BIT_ACCESS(LCDDATA22,3)
// LCDDATA4<SEG36COM0>
extern volatile __bit                   SEG36COM0           __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 SEG36COM0_bit       _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<SEG36COM1>
extern volatile __bit                   SEG36COM1           __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 SEG36COM1_bit       _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<SEG36COM2>
extern volatile __bit                   SEG36COM2           __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 SEG36COM2_bit       _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<SEG36COM3>
extern volatile __bit                   SEG36COM3           __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 SEG36COM3_bit       _BIT_ACCESS(LCDDATA22,4)
// LCDDATA4<SEG37COM0>
extern volatile __bit                   SEG37COM0           __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 SEG37COM0_bit       _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<SEG37COM1>
extern volatile __bit                   SEG37COM1           __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 SEG37COM1_bit       _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<SEG37COM2>
extern volatile __bit                   SEG37COM2           __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SEG37COM2_bit       _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<SEG37COM3>
extern volatile __bit                   SEG37COM3           __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 SEG37COM3_bit       _BIT_ACCESS(LCDDATA22,5)
// LCDDATA4<SEG38COM0>
extern volatile __bit                   SEG38COM0           __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 SEG38COM0_bit       _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<SEG38COM1>
extern volatile __bit                   SEG38COM1           __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 SEG38COM1_bit       _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<SEG38COM2>
extern volatile __bit                   SEG38COM2           __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 SEG38COM2_bit       _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<SEG38COM3>
extern volatile __bit                   SEG38COM3           __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 SEG38COM3_bit       _BIT_ACCESS(LCDDATA22,6)
// LCDDATA4<SEG39COM0>
extern volatile __bit                   SEG39COM0           __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 SEG39COM0_bit       _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<SEG39COM1>
extern volatile __bit                   SEG39COM1           __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 SEG39COM1_bit       _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<SEG39COM2>
extern volatile __bit                   SEG39COM2           __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 SEG39COM2_bit       _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<SEG39COM3>
extern volatile __bit                   SEG39COM3           __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 SEG39COM3_bit       _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<SEG3COM0>
extern volatile __bit                   SEG3COM0            __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 SEG3COM0_bit        _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<SEG3COM1>
extern volatile __bit                   SEG3COM1            __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 SEG3COM1_bit        _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<SEG3COM2>
extern volatile __bit                   SEG3COM2            __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 SEG3COM2_bit        _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<SEG3COM3>
extern volatile __bit                   SEG3COM3            __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 SEG3COM3_bit        _BIT_ACCESS(LCDDATA18,3)
// PORTD<SEG4>
extern volatile __bit                   SEG4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 SEG4_bit            _BIT_ACCESS(PORTD,4)
// LCDDATA5<SEG40COM0>
extern volatile __bit                   SEG40COM0           __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 SEG40COM0_bit       _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<SEG40COM1>
extern volatile __bit                   SEG40COM1           __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 SEG40COM1_bit       _BIT_ACCESS(LCDDATA11,0)
// LCDDATA17<SEG40COM2>
extern volatile __bit                   SEG40COM2           __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 SEG40COM2_bit       _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<SEG40COM3>
extern volatile __bit                   SEG40COM3           __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 SEG40COM3_bit       _BIT_ACCESS(LCDDATA23,0)
// LCDDATA5<SEG41COM0>
extern volatile __bit                   SEG41COM0           __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 SEG41COM0_bit       _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<SEG41COM1>
extern volatile __bit                   SEG41COM1           __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 SEG41COM1_bit       _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<SEG41COM2>
extern volatile __bit                   SEG41COM2           __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 SEG41COM2_bit       _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<SEG41COM3>
extern volatile __bit                   SEG41COM3           __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 SEG41COM3_bit       _BIT_ACCESS(LCDDATA23,1)
// LCDDATA5<SEG42COM0>
extern volatile __bit                   SEG42COM0           __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 SEG42COM0_bit       _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<SEG42COM1>
extern volatile __bit                   SEG42COM1           __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 SEG42COM1_bit       _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<SEG42COM2>
extern volatile __bit                   SEG42COM2           __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 SEG42COM2_bit       _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<SEG42COM3>
extern volatile __bit                   SEG42COM3           __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 SEG42COM3_bit       _BIT_ACCESS(LCDDATA23,2)
// LCDDATA5<SEG43COM0>
extern volatile __bit                   SEG43COM0           __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 SEG43COM0_bit       _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<SEG43COM1>
extern volatile __bit                   SEG43COM1           __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 SEG43COM1_bit       _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<SEG43COM2>
extern volatile __bit                   SEG43COM2           __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 SEG43COM2_bit       _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<SEG43COM3>
extern volatile __bit                   SEG43COM3           __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 SEG43COM3_bit       _BIT_ACCESS(LCDDATA23,3)
// LCDDATA5<SEG44COM0>
extern volatile __bit                   SEG44COM0           __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 SEG44COM0_bit       _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<SEG44COM1>
extern volatile __bit                   SEG44COM1           __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 SEG44COM1_bit       _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<SEG44COM2>
extern volatile __bit                   SEG44COM2           __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 SEG44COM2_bit       _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<SEG44COM3>
extern volatile __bit                   SEG44COM3           __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 SEG44COM3_bit       _BIT_ACCESS(LCDDATA23,4)
// LCDDATA5<SEG45COM0>
extern volatile __bit                   SEG45COM0           __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 SEG45COM0_bit       _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<SEG45COM1>
extern volatile __bit                   SEG45COM1           __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 SEG45COM1_bit       _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<SEG45COM2>
extern volatile __bit                   SEG45COM2           __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 SEG45COM2_bit       _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<SEG45COM3>
extern volatile __bit                   SEG45COM3           __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 SEG45COM3_bit       _BIT_ACCESS(LCDDATA23,5)
// LCDDATA5<SEG46COM0>
extern volatile __bit                   SEG46COM0           __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 SEG46COM0_bit       _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<SEG46COM1>
extern volatile __bit                   SEG46COM1           __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 SEG46COM1_bit       _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<SEG46COM2>
extern volatile __bit                   SEG46COM2           __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 SEG46COM2_bit       _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<SEG46COM3>
extern volatile __bit                   SEG46COM3           __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 SEG46COM3_bit       _BIT_ACCESS(LCDDATA23,6)
// LCDDATA5<SEG47COM0>
extern volatile __bit                   SEG47COM0           __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 SEG47COM0_bit       _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<SEG47COM1>
extern volatile __bit                   SEG47COM1           __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 SEG47COM1_bit       _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<SEG47COM2>
extern volatile __bit                   SEG47COM2           __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 SEG47COM2_bit       _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<SEG47COM3>
extern volatile __bit                   SEG47COM3           __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 SEG47COM3_bit       _BIT_ACCESS(LCDDATA23,7)
// LCDDATA0<SEG4COM0>
extern volatile __bit                   SEG4COM0            __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 SEG4COM0_bit        _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<SEG4COM1>
extern volatile __bit                   SEG4COM1            __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 SEG4COM1_bit        _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<SEG4COM2>
extern volatile __bit                   SEG4COM2            __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 SEG4COM2_bit        _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<SEG4COM3>
extern volatile __bit                   SEG4COM3            __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 SEG4COM3_bit        _BIT_ACCESS(LCDDATA18,4)
// PORTD<SEG5>
extern volatile __bit                   SEG5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 SEG5_bit            _BIT_ACCESS(PORTD,5)
// LCDDATA0<SEG5COM0>
extern volatile __bit                   SEG5COM0            __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 SEG5COM0_bit        _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<SEG5COM1>
extern volatile __bit                   SEG5COM1            __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 SEG5COM1_bit        _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<SEG5COM2>
extern volatile __bit                   SEG5COM2            __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 SEG5COM2_bit        _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<SEG5COM3>
extern volatile __bit                   SEG5COM3            __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 SEG5COM3_bit        _BIT_ACCESS(LCDDATA18,5)
// PORTD<SEG6>
extern volatile __bit                   SEG6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SEG6_bit            _BIT_ACCESS(PORTD,6)
// LCDDATA0<SEG6COM0>
extern volatile __bit                   SEG6COM0            __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 SEG6COM0_bit        _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<SEG6COM1>
extern volatile __bit                   SEG6COM1            __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 SEG6COM1_bit        _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<SEG6COM2>
extern volatile __bit                   SEG6COM2            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 SEG6COM2_bit        _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<SEG6COM3>
extern volatile __bit                   SEG6COM3            __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 SEG6COM3_bit        _BIT_ACCESS(LCDDATA18,6)
// PORTD<SEG7>
extern volatile __bit                   SEG7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SEG7_bit            _BIT_ACCESS(PORTD,7)
// LCDDATA0<SEG7COM0>
extern volatile __bit                   SEG7COM0            __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 SEG7COM0_bit        _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<SEG7COM1>
extern volatile __bit                   SEG7COM1            __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 SEG7COM1_bit        _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<SEG7COM2>
extern volatile __bit                   SEG7COM2            __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 SEG7COM2_bit        _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<SEG7COM3>
extern volatile __bit                   SEG7COM3            __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 SEG7COM3_bit        _BIT_ACCESS(LCDDATA18,7)
// PORTB<SEG8>
extern volatile __bit                   SEG8                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 SEG8_bit            _BIT_ACCESS(PORTB,1)
// LCDDATA1<SEG8COM0>
extern volatile __bit                   SEG8COM0            __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 SEG8COM0_bit        _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<SEG8COM1>
extern volatile __bit                   SEG8COM1            __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 SEG8COM1_bit        _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<SEG8COM2>
extern volatile __bit                   SEG8COM2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG8COM2_bit        _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<SEG8COM3>
extern volatile __bit                   SEG8COM3            __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 SEG8COM3_bit        _BIT_ACCESS(LCDDATA19,0)
// PORTB<SEG9>
extern volatile __bit                   SEG9                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 SEG9_bit            _BIT_ACCESS(PORTB,2)
// LCDDATA1<SEG9COM0>
extern volatile __bit                   SEG9COM0            __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 SEG9COM0_bit        _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<SEG9COM1>
extern volatile __bit                   SEG9COM1            __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 SEG9COM1_bit        _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<SEG9COM2>
extern volatile __bit                   SEG9COM2            __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SEG9COM2_bit        _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<SEG9COM3>
extern volatile __bit                   SEG9COM3            __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 SEG9COM3_bit        _BIT_ACCESS(LCDDATA19,1)
// LCDSE0<SEGEN0>
extern volatile __bit                   SEGEN0              __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 SEGEN0_bit          _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SEGEN1>
